function [ F ] = dft2D( f )
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  dft2D()函数实现一个的二维快速傅里叶变换(FFT)图像
%  f表示：输入图像                  F表示：FFT图像
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
sizef = size(f);            %获取输入图像的尺寸大小
M = sizef(1);               %像素矩阵的行数
N = sizef(2);               %像素矩阵的列数
F = zeros(M,N);             %定义输出矩阵
Fxv = zeros(M,N);           %定义中间矩阵
% 循环：以下通过两轮一维傅里叶变换实现二维FFT计算
for i = 1:M
    Fxv(i,:)=fft(f(i,:));   %循环M次计算F(x,v)
end
for j = 1:N
    F(:,j)=fft(Fxv(:,j));   %循环N次计算F(u,v)
end
end

